src/cf/InformationRegisters/CRM_РасшифровкиСтатусовПисемEmailРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_РасшифровкиСтатусовПисемEmailРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_РасшифровкиСтатусовПисемEmailРассылки/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьРасшифровкиСтатусов() Экспорт
	
	Для каждого МетаМакет из Метаданные.РегистрыСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки.Макеты Цикл
		
		Макет = РегистрыСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки.ПолучитьМакет(МетаМакет.Имя);
		НомерСтроки = 1;
		Пока Истина Цикл
			
			НомерСтроки = НомерСтроки + 1;
			Если СокрЛП(Макет.Область(НомерСтроки,1).Текст) = "" Тогда
				Прервать;
			КонецЕсли;
			КодСтатуса	= СокрЛП(Макет.Область(НомерСтроки,1).Текст);
			Расшифровка	= СокрЛП(Макет.Область(НомерСтроки,2).Текст);
			
			МенеджерЗаписи = РегистрыСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.КодСтатуса = КодСтатуса;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Расшифровка<>Расшифровка Тогда
				МенеджерЗаписи.КодСтатуса = КодСтатуса;
				МенеджерЗаписи.Расшифровка = Расшифровка;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
